emacs.org
- Control Panel :: hello there :)
  - [[elisp:(elfeed)][Elfeed]]
  - [[elisp:(benchmark-init/show-durations-tabulated)][Show Durations]]
  - [[elisp:(paradox-upgrade-packages)][Upgrade Packages]]

* Feed                                                                          :elfeed:
** https://blog.aaronbieber.com/feed.xml
** http://cestlaz.github.io/rss.xml
** http://nullprogram.com/feed/
** http://emacshorrors.com/feed.atom
** http://endlessparentheses.com/atom.xml
** http://kitchingroup.cheme.cmu.edu/blog/category/babel/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/org/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/org-mode/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/orgmode/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/python/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/elisp/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/emacs-lisp/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/emacs-lisp/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/emacs/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/emacslisp/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/lisp/feed/
** http://kitchingroup.cheme.cmu.edu/blog/category/literate-programming/feed/
** http://pragmaticemacs.com/feed/
** http://sachachua.com/blog/category/emacs-news/feed
** https://shiyuangu.com/feed/
** https://emacs-el.com/rss.xml
* Research
** TODO EMMS
- [[http://hack.org/mc/blog/emms.html][Using EMMS on OS X | MC's Journal]]

** TODO [[https://github.com/Kungsgeten/org-brain][GitHub - Kungsgeten/org-brain: Org-mode wiki + concept-mapping]]
** [[http://kitchingroup.cheme.cmu.edu/blog/2017/06/10/Adding-keymaps-to-src-blocks-via-org-font-lock-hook/][Adding keymaps to src blocks via org-font-lock-hook]]
** [[https://ekaschalk.github.io/#posts][Eric Kaschalk on Emacs]]
** Configs
- [[https://github.com/howardabrams/dot-files][GitHub - howardabrams/dot-files: My Emacs initialization code and standard scripts I use for client and servers alike.]]
- [[https://github.com/caisah/emacs.dz][GitHub - caisah/emacs.dz: Awesome emacs config files]]
- [[https://github.com/jkitchin/scimax/tree/org-9][GitHub - jkitchin/scimax at org-9]]
- [[https://github.com/hlissner/.emacs.d/][GitHub - hlissner/.emacs.d: Emacs for the stubborn martian vimmer]]
- [[https://github.com/marktran/emacs.d][GitHub - marktran/emacs.d: Emacs configuration files]]
- [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua's Emacs configuration]]
- [[http://www.reddit.com/r/emacs/comments/3dt1ao/july_2015_emacs_hangout_sacha_chua_living_an/?utm_source=dlvr.it&utm_medium=twitter][July 2015 Emacs Hangout - sacha chua :: living an awesome life : emacs]]
- [[https://www.youtube.com/watch?v=dljNabciEGg][Literate Devops with Emacs - YouTube]]
** TODO [[https://www.reddit.com/r/emacs/comments/6a3oxv/ledgerledgermode_tips_and_tricks/][ledger/ledger-mode tips and tricks]]
** TODO [[http://blog.garage-coding.com/2015/12/12/offline-reading-setup.html][Offline reading setup]]
** TODO [[http://home.fnal.gov/~neilsen/notebook/orgExamples/org-examples.html#sec-23][Emacs org-mode examples and cookbook]]
** TODO [[https://github.com/caffo/org-minimal-html-theme][GitHub - caffo/org-minimal-html-theme: Simple and beautiful orgmode HTML export theme]]
** TODO [[http://plantuml.sourceforge.net/emacs.html][Emacs UML]]
** TODO [[https://github.com/vermiculus/sx.el][GitHub - vermiculus/sx.el: Stack Exchange for Emacs]]
** TODO [[http://www.informatimago.com/linux/emacs-on-user-mode-linux.html][Emacs standing alone on Linux Kernel]]
** TODO https://eschulte.github.io/org-scraps/
** TODO [[http://blog.binchen.org/posts/hello-ivy-mode-bye-helm.html][Hello Ivy-mode, bye Helm | Chen's blog]]
** TODO [[https://github.com/Andersbakken/emacs-backup-file][GitHub - Andersbakken/emacs-backup-file: Automatically back up all changes made from emacs to a git repo in ~/.backups]]
** TODO [[http://joostkremers.github.io/pandoc-mode/][Pandoc-mode by joostkremers]]
** TODO http://ericjmritz.name/2014/04/26/screenwrite-mode-for-gnu-emacs/
** TODO http://ericjmritz.name/2014/12/23/using-quickrun-in-emacs/
** TODO [[https://github.com/jwiegley/emacs-async][Emacs Async]]
** TODO [[http://cedet.sourceforge.net/][CEDET]]
- [ ] [[http://alexott.net/ru/writings/emacs-devenv/EmacsCedet.html#fn.1][Использование Emacs вместе с CEDET]]
- [ ] [[https://writequit.org/denver-emacs/presentations/2017-02-21-semantic-mode.html][Semantic Mode]]
** TODO Настроить RSync между облаками
** TODO Code folding
http://www.emacswiki.org/emacs/FoldingMode
https://github.com/emacsmirror/fold-dwim/blob/master/fold-dwim.el
https://github.com/mlf176f2/fold-dwim-org/blob/master/fold-dwim-org.el
http://www.emacswiki.org/emacs/download/hideshowvis.el
http://lists.gnu.org/archive/html/gnu-emacs-sources/2004-11/msg00047.html
http://www.emacswiki.org/emacs/fold-dwim-org.el
** TODO Code completion
http://stackoverflow.com/questions/6865344/is-it-possible-to-get-code-completion-for-r-in-emacs-ess-similar-to-what-is-avai/7890516#7890516
** TODO Настроить [[https://medium.com/@kirang89/emacs-as-email-client-with-offlineimap-and-mu4e-on-os-x-3ba55adc78b6#.v39cr8jxb][почтовый клиент]] [0/5]
- [ ] http://www.kirang.in/2014/11/13/emacs-as-email-client-with-offlineimap-and-mu4e-on-osx/
- [ ] [[https://vxlabs.com/2017/02/07/mu4e-0-9-18-e-mailing-with-emacs-now-even-better/][mu4e 0.9.18: E-Mailing with Emacs now even better. – vxlabs]]
- [ ] [[http://emacs.stackexchange.com/questions/14687/automating-inbox-zero-with-the-org-agenda][org mode - Automating inbox zero with the org agenda? - Emacs Stack Exchange]]
- [ ] [[https://github.com/pierre-lecocq/emacs4developers/blob/master/chapters/05-special-features.org#emails-in-emacs][Emails in emacs]]
- [ ] [[http://pragmaticemacs.com/emacs/an-unobtrusive-email-monitor-for-mu4e-on-the-mac/][An unobtrusive email monitor for mu4e on the Mac | Pragmatic Emacs]]
- [ ] [[https://www.reddit.com/r/emacs/comments/6dg7t3/mu4eisyncmbsync_dont_ask_for_password_unlocking/][mu4e+isync/mbsync: don't ask for password unlocking at each run? : emacs]]
** TODO Rename eshell on process start
- (get-buffer-process (get-buffer "*dev2f-shell*"))
** TODO Encode region
** TODO [[https://lists.gnu.org/archive/html/emacs-orgmode/2015-05/msg00556.html][Emacs with Siri]]
** TODO [[http://kitchingroup.cheme.cmu.edu/blog/2016/05/29/Expanding-orgmode-py-to-get-better-org-python-integration/][Org-mode.py]]
** TODO Dired-buffers switching (C-x C-d C-d C-d ...)
** TODO Навигация org-mode через ido
* Config
:PROPERTIES:
:header-args: :results silent :mkdirp yes
:END:

** Core
*** alert
#+begin_src emacs-lisp
(use-package alert
  :ensure t)
#+end_src
*** benchmark
#+begin_src emacs-lisp
(use-package benchmark-init
  :config (progn
            (benchmark-init/activate))
  :ensure t)
#+end_src
*** [[https://github.com/hlissner/.emacs.d/blob/master/core/core.el][Encoding]]
#+begin_src emacs-lisp
;; UTF-8 as the default coding system
(set-charset-priority 'unicode)
(prefer-coding-system        'utf-8)
(set-terminal-coding-system  'utf-8)
(set-keyboard-coding-system  'utf-8)
(set-selection-coding-system 'utf-8)
(setq locale-coding-system   'utf-8)
(setq-default buffer-file-coding-system 'utf-8)
#+end_src
*** [[http://pragmaticemacs.com/emacs/make-emacs-a-bit-quieter/][Make emacs bit quieter]]
#+begin_src emacs-lisp
(advice-add #'display-startup-echo-area-message :override #'ignore)
#+end_src
*** after-load
#+begin_src emacs-lisp
(defmacro after-load (feature &rest body)
  "After FEATURE is loaded, evaluate BODY."
  (declare (indent defun))
  `(eval-after-load ,feature
     '(progn ,@body)))
#+end_src
*** paths
#+begin_src emacs-lisp
  (defun tmp/ (filename)
    "Get path to FILENAME in temp directory."
    (let ((dir "/tmp/emacs/"))
      (make-directory dir t)
      (concat dir filename)))

  (defun shared/ (filename)
    "Get path to FILENAME in shared directory."
    (let ((dir "~/Yandex.Disk.localized/Emacs/"))
      (make-directory dir t)
      (concat dir filename)))

  (setq-default custom-file (tmp/ "custom.el"))
  (setq-default bmkp-bmenu-stat-file (tmp/ "emacs-bmk-bmenu-state.el")
		bookmark-default-file (shared/ "bookmarks.txt")
		bookmark-save-flag t)
#+end_src
*** os
#+begin_src emacs-lisp
  (defconst IS-MAC   (eq system-type 'darwin))
  (defconst IS-LINUX (eq system-type 'gnu/linux))
#+end_src

**** osx
#+begin_src emacs-lisp
  (cond (IS-MAC
         (setq mac-command-modifier 'meta
               mac-option-modifier  'alt
               ;; sane trackpad/mouse scroll settings
               mac-redisplay-dont-reset-vscroll t
               mac-mouse-wheel-smooth-scroll nil
               mouse-wheel-scroll-amount '(5 ((shift) . 2))  ; one line at a time
               mouse-wheel-progressive-speed nil             ; don't accelerate scrolling
               ;; Curse Lion and its sudden but inevitable fullscreen mode!
               ;; NOTE Meaningless to railwaycat's emacs-mac build
               ns-use-native-fullscreen t
               ;; Don't open files from the workspace in a new frame
               ns-pop-up-frames nil
               alert-default-style 'osx-notifier)

         (cond ((display-graphic-p)
                ;; A known problem with GUI Emacs on MacOS: it runs in an isolated
                ;; environment, so envvars will be wrong. That includes the PATH
                ;; Emacs picks up. `exec-path-from-shell' fixes this. This is slow
                ;; and benefits greatly from compilation.
                (setq exec-path
                      (or (eval-when-compile
                            (when (require 'exec-path-from-shell nil t)
                              (setq exec-path-from-shell-check-startup-files nil
                                    exec-path-from-shell-arguments (delete "-i" exec-path-from-shell-arguments))
                              (nconc exec-path-from-shell-variables '("GOPATH" "GOROOT" "PYTHONPATH"))
                              (exec-path-from-shell-initialize)
                              ;; (persistent-soft-store 'exec-path exec-path "emacs")
                              exec-path))
                          exec-path)))
               (t
                (when (require 'osx-clipboard nil t)
                  (osx-clipboard-mode +1))))))
#+end_src
*** dired
**** dired-subtree
#+BEGIN_SRC emacs-lisp
(put 'dired-find-alternate-file 'disabled nil)

(defun dired-subtree-up-or-directory-up ()
  (interactive)
  (if-let (ov (dired-subtree--get-ov))
      (progn
        (goto-char (overlay-start ov))
        (dired-previous-line 1))
    (find-alternate-file "..")))

(use-package dired-subtree
  :config
  (bind-keys :map dired-mode-map
             ("<backspace>" . dired-subtree-up-or-directory-up)
             ("<tab>" . dired-subtree-cycle)))
#+END_SRC
**** dired-narrow
#+BEGIN_SRC emacs-lisp
(use-package dired-narrow
  :ensure t)
(define-key dired-mode-map (kbd "/") 'dired-narrow-fuzzy)
#+END_SRC
**** dired-switch-or-jump
#+BEGIN_SRC emacs-lisp
(defun dired/switch-or-jump ()
  "Quickly switch to dired buffer."
  (interactive)
  (progn (let ((dbufs  (cl-remove-if-not
                        (lambda (bf)
                          (with-current-buffer bf
                            (derived-mode-p 'dired-mode)))
                        (buffer-list))))
           (if dbufs
               (switch-to-buffer (car dbufs))
             (dired-jump)))))
(define-key global-map (kbd "C-x C-d") 'dired/switch-or-jump)
#+END_SRC
**** dired-rainbow
#+BEGIN_SRC emacs-lisp
(use-package dired-rainbow
  :config (progn
            (dired-rainbow-define html "#4e9a06" ("htm" "html" "xhtml"))
            (dired-rainbow-define media "#ce5c00" ("mp3" "mp4" "MP3" "MP4" "avi" "mpg" "flv" "ogg"))
            (dired-rainbow-define log (:inherit default :italic t) ".*\\.log")
            (dired-rainbow-define-chmod executable-unix "#B3DE81" "-[rw-]+x.*"))
  :ensure t)
#+END_SRC
**** sorting
***** sort directories first
#+BEGIN_SRC emacs-lisp
(defun dired/sort ()
  "Sort dired listings with directories first."
  (save-excursion
    (let (buffer-read-only)
      (forward-line 2) ;; beyond dir. header
      (sort-regexp-fields t "^.*$" "[ ]*." (point) (point-max)))
    (set-buffer-modified-p nil)))

(defadvice dired-readin (after dired-after-updating-hook first () activate)
  "Sort dired listings with directories first before mark adding."
  (dired/sort))
#+END_SRC
***** [[http://pragmaticemacs.com/emacs/case-insensitive-sorting-in-dired-on-os-x/][Case-Insensitive Sorting in Dired on OS X | Pragmatic Emacs]]
#+BEGIN_SRC emacs-lisp
;; using ls-lisp with these settings gives case-insensitve
;; sorting on OS X
(require 'ls-lisp)
(setq dired-listing-switches "-alhG")
(setq ls-lisp-use-insert-directory-program nil)
(setq ls-lisp-ignore-case t)
(setq ls-lisp-use-string-collate nil)
;; customise the appearance of the listing
(setq ls-lisp-verbosity '(links uid))
(setq ls-lisp-format-time-list '("%b %e %H:%M" "%b %e  %Y"))
(setq ls-lisp-use-localized-time-format t)
#+END_SRC
*** eshell
#+begin_src emacs-lisp
  (setq-default
   eshell-buffer-maximum-lines 500
   eshell-output-filter-functions
   '(eshell-truncate-buffer
     eshell-postoutput-scroll-to-bottom
     eshell-handle-control-codes
     eshell-handle-ansi-color
     eshell-watch-for-password-prompt)
   password-cache t
   password-cache-expiry 3600)

  (with-eval-after-load 'em-alias
    ;;; TODO: This conflicts with `evil-define-key' during the initialization of
    ;;; the first eshell session: the map in insert-mode will not take the changes
    ;;; into account. Going to normal mode and back to insert mode works.
    (eshell-read-aliases-list)
    (dolist
	(alias
	 '(("l" "ls -1 $*")
	   ("la" "ls -lAh $*")
	   ("ll" "ls -lh $*")
	   ;; ("ls" "ls -F $*")
	   ;; ("emacs" "find-file $1")
	   ;; ("em" "find-file $*")
	   ("cp" "*cp -i $*")
	   ("mv" "*mv -i $*")
	   ("mkdir" "*mkdir -p $*")
	   ("mkcd" "*mkdir -p $* && cd $1")))
      (add-to-list 'eshell-command-aliases-list alias))
    (eshell-write-aliases-list))

  ;; (let ((process-environment tramp-remote-process-environment))
  ;;   (setenv "LANG" "en_US.UTF-8")
  ;;   (setenv "LC_ALL" "en_US.UTF-8")
  ;;   (setenv "LC_CTYPE" "en_US.UTF-8")
  ;;   (setq tramp-remote-process-environment process-environment))

  (use-package exec-path-from-shell
    :config (progn
	      (when (memq window-system '(mac ns))
		(exec-path-from-shell-initialize)
		(exec-path-from-shell-copy-env "SSH_AGENT_PID")
		(exec-path-from-shell-copy-env "SSH_AUTH_SOCK")))
    :ensure t)
#+end_src
*** ace-window
#+begin_src emacs-lisp :results silent
(use-package ace-window
  :config (progn
            (setq aw-keys '(?a ?b ?c ?d ?e ?f ?g ?h ?i)))
  :bind (("C-x o" . ace-window))
  :ensure t)
#+end_src
*** split-window
#+begin_src emacs-lisp
(defun split-window-func-with-other-buffer (split-function)
  (lexical-let ((s-f split-function))
    (lambda ()
      (interactive)
      (funcall s-f)
      (set-window-buffer (next-window) (other-buffer)))))

(defun split-window-vertically-swap ()
  (interactive)
  (funcall (split-window-func-with-other-buffer 'split-window-vertically)))

(defun split-window-horizontally-swap ()
  (interactive)
  (funcall (split-window-func-with-other-buffer 'split-window-horizontally)))

(define-key global-map (kbd "C-x 2") 'split-window-vertically-swap)
(define-key global-map (kbd "C-x 3") 'split-window-horizontally-swap)
#+end_src
*** super-save
#+begin_src emacs-lisp
(use-package super-save
  :config (progn
            (super-save-initialize)
            (setq super-save-auto-save-when-idle t))
  :ensure t)
#+end_src
*** delete-trailing-whitespace
#+begin_src emacs-lisp
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src
*** delete-other-windows
#+begin_src emacs-lisp
(use-package delete-other-windows
  :no-require t
  :bind (("C-x 1" . delete-other-windows)))
#+end_src
