emacs.org
** Unsorted
#+begin_src emacs-lisp
;; Some unsorted stuff:

(use-package init-web
  :load-path "packages/prog")

(use-package init-editing-utils
  :load-path "lisp")

(use-package indent-tools
  :bind (("C-x >" . indent-tools-hydra/body))
  :ensure t)

(use-package init-paredit
  :load-path "lisp")

(use-package init-lisp
  :load-path "lisp")

;; n(org-babel-load-file
;;  (expand-file-name "packages/org/beautify-emphasis.org"
;;                   user-emacs-directory))

(use-package locales
  :init (progn
          (defun sanityinc/utf8-locale-p (v)
            "Return whether locale string V relates to a UTF-8 locale."
            (and v (string-match "UTF-8" v)))

          (defun locale-is-utf8-p ()
            "Return t iff the \"locale\" command or environment variables prefer UTF-8."
            (or (sanityinc/utf8-locale-p (and (executable-find "locale") (shell-command-to-string "locale")))
                (sanityinc/utf8-locale-p (getenv "LC_ALL"))
                (sanityinc/utf8-locale-p (getenv "LC_CTYPE"))
                (sanityinc/utf8-locale-p (getenv "LANG"))))

          (when (or window-system (locale-is-utf8-p))
            (setq utf-translate-cjk-mode nil) ; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
            (set-language-environment 'utf-8)
            (setq locale-coding-system 'utf-8)
            (set-default-coding-systems 'utf-8)
            (set-terminal-coding-system 'utf-8)
            (unless (eq system-type 'windows-nt)
              (set-selection-coding-system 'utf-8))
            (prefer-coding-system 'utf-8))

          (use-package ucs-utils)
          (use-package unicode-fonts
            :config (progn
                      (unicode-fonts-setup)))
          (use-package font-utils)))

(use-package multiple-cursors
  :bind (("C-<" . mc/mark-previous-like-this)
         ("C->" . mc/mark-next-like-this)
         ("C-+" . mc/mark-all-like-this))
  :config (progn
            (setq-default mc/list-file (tmp/ "multiple-cursors-data.el")))
  :ensure t)

(use-package regex-tool
  :commands regex-tool
  :ensure t)

(use-package pdf-tools
  :commands pdf-tools-install
  :ensure t)

;; (use-package nhexl-mode)
#+end_src
** UI
*** visible-bell
#+BEGIN_SRC emacs-lisp
(setq visible-bell t)
#+END_SRC
*** rainbow-delimiters
#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :ensure t)
#+END_SRC
*** cleanups
#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
(delete-selection-mode 1)
(tool-bar-mode -1)
(menu-bar-mode -1)
(toggle-scroll-bar -1)
(blink-cursor-mode 0)

(custom-set-faces
 '(default ((t (
                :inherit nil
                :stipple nil
                :inverse-video nil
                :box nil
                :strike-through nil
                :overline nil
                :underline nil
                :slant normal
                :weight normal
                :height 120
                :width normal
                :foundry nil
                :family "Menlo")))))

(setq-default case-fold-search t
              compilation-scroll-output t
              ediff-split-window-function 'split-window-horizontally
              ediff-window-setup-function 'ediff-setup-windows-plain
              grep-highlight-matches t
              grep-scroll-output t
              make-backup-files nil
              mouse-yank-at-point t
              save-interprogram-paste-before-kill t
              scroll-preserve-screen-position 'always
              set-mark-command-repeat-pop t
              show-trailing-whitespace nil
              tooltip-delay 1.5
              truncate-lines nil
              truncate-partial-width-windows nil
              indent-tabs-mode nil
              x-use-underline-position-properties t
              underline-minimum-offset 3
              inhibit-startup-screen t
              line-spacing 7
              visible-bell nil
              cursor-type 'box
              split-width-threshold 160
              split-height-threshold nil
              frame-title-format '((:eval (if (buffer-file-name) (abbreviate-file-name (buffer-file-name)) "%b"))) buffers-menu-max-size 30)

(defun what-face (pos)
  "Tell me what face used in POS."
  (interactive "d")
  (let ((face (or (get-char-property (point) 'read-face-name)
                  (get-char-property (point) 'face))))
    (if face (message "Face: %s" face) (message "No face at %d" pos))))
#+end_src
*** Themes
**** Default
#+BEGIN_SRC emacs-lisp
;; (use-package minimal-theme
;;  :load-path "themes")

(use-package danneskjold-theme
  :ensure t)
#+END_SRC
**** Minimal                                                                 :ARCHIVE:
#+BEGIN_SRC emacs-lisp :tangle themes/minimal-theme.el
;;; minimal-theme.el --- A minimal theme based on default colors.
;; This file is not part of GNU Emacs.
;;; Commentary:
;;; License:
;; Use of this source code is governed by the 'Revised BSD License'
;; which can be found in the LICENSE file.
;;; Code:

(deftheme minimal
  "A minimal theme based on xterm-256 color set [dark version]")

(custom-theme-set-faces
 'minimal
 `(org-ellipsis                    ((t (:inherit hs-face))))

 ;; Mode-line
 `(mode-line ((t (:background "grey75" :box ,(list :line-width 4 :color "grey75")))))
 `(mode-line-inactive ((t (:background "grey90" :foreground "grey20" :box ,(list :line-width 4 :color "grey90"))))))

;; Set variables
(custom-theme-set-variables
 'minimal)

;;;###autoload
(when load-file-name
  (add-to-list 'custom-theme-load-path
	       (file-name-as-directory (file-name-directory load-file-name))))

(provide-theme 'minimal)
;; Local Variables:
;; no-byte-compile: t
;; End:
;;; minimal-theme.el ends here
#+END_SRC
** Local
#+begin_src emacs-lisp
  (require 'init-local nil t)
#+end_src
